N, M = map(int, input().split())
matrix = [list(map(int, input().split())) for _ in range(N)]


tets = [[(0,1), (0,2), (0,3)], [(1,0), (2,0), (3,0)], # 1x4 형태
        [(0,1), (1,0), (1,1)], # 2x2형태
        [(1,0),(1,1),(2,1)], [(0,-1), (1,-1), (1,-2)], # ㄹ자 (회전)
        [(1,0), (1,-1), (2,-1)],[(0,1), (1,1), (1,2)], # ㄹ자 (대칭)
        [(1,0), (2,0), (2,1)], [(0,1), (0,2), (1,0)], # ㄴ자 (회전)
        [(0,1),(1,1), (2,1)], [(0,1), (0,2), (-1,2)],
        [(1,0),(2,0),(2,-1)],[(0,1),(0,2),(1,2)], # ㄴ자 (대칭)
        [(1,0),(2,0),(0,1)], [(1,0),(1,1),(1,2)],
        [(1,0),(1,1),(1,-1)], [(1,0),(1,1),(2,0)], # ㅗ자(회전)
        [(0,-1),(1,0),(0,1)],[(0,1),(-1,1),(1,1)]]
max_num = -1
for i in range(N):
    for j in range(M):
        # 테트로미노 탐색 시작
        for tet in tets:
            tmp_num = matrix[i][j]
            for di, dj in tet:
                ni, nj = i + di, j + dj
                # 유효한 위치일때만 더함
                if 0 <= ni < N and 0 <= nj < M:
                    tmp_num += matrix[ni][nj]
            max_num = max(tmp_num, max_num)
            tmp_num = -1

print(max_num)